


Network Working Group                                  Igor Umansky, Ed.
Internet-Draft                                           Italo Busi, Ed.
Intended status: Standard Track                           Alcatel-Lucent
Expires: September 29, 2010                       Huub van Helvoort, Ed.
                                                       Haiyan Zhang, Ed.
                                                     Huawei Technologies
                                                             Han Li, Ed.
                                 China Mobile Communications Corporation
                                                       Ruiquan Jing, Ed.
                                                           China Telecom

                                                        January 26, 2010


               MPLS-TP Ring Protection Switching (MRPS)
         draft-umansky-mpls-tp-ring-protection-switching-01.txt

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on September 29, 2010.

Copyright Notice

   Copyright (c) 2010 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents (http://trustee.ietf.org/
   license-info) in effect on the date of publication of this document.
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.


Umansky, et al.        Expires September 29, 2010               [Page 1]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


Abstract

   This document describes a mechanism to address the requirements for
   protection of the Multi-Protocol Label Switching Transport Profile
   (MPLS-TP) Label Switched Paths (LSP) in a ring topology. The
   mechanism defined herein is designed to support point-to-point
   as well as point-to-multipoint LSPs.

   The MPLS-TP section layer OAM is used to monitor the connectivity
   between each two adjacent nodes using the mechanisms defined in the
   [MPLS-TP OAM].

   The Automatic Protection Switching (APS) protocol is used for
   coordination of protection switching actions between the ring nodes.


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 3
   2.  Conventions used in this document . . . . . . . . . . . . . . . 3
     2.1.  Abbreviations . . . . . . . . . . . . . . . . . . . . . . . 4
   3.  Ring protection schemes . . . . . . . . . . . . . . . . . . . . 5
     3.1.  Wrapping  . . . . . . . . . . . . . . . . . . . . . . . . . 5
       3.1.1.  Wrapping protection scheme applicability. . . . . . . . 5
       3.1.2.  P-t-p LSP example . . . . . . . . . . . . . . . . . . . 6
       3.1.3.  P-t-mp LSP example. . . . . . . . . . . . . . . . . . . 9
     3.2.  Steering. . . . . . . . . . . . . . . . . . . . . . . . . .11
       3.2.1.  Steering protection scheme applicability. . . . . . . .12
       3.2.2.  P-t-p LSP example . . . . . . . . . . . . . . . . . . .12
       3.2.3.  P-t-mp LSP example. . . . . . . . . . . . . . . . . . .15
   4.  MRPS characteristics. . . . . . . . . . . . . . . . . . . . . .18
     4.1.  Switching types . . . . . . . . . . . . . . . . . . . . . .18
     4.2.  Operation types . . . . . . . . . . . . . . . . . . . . . .18
     4.3.  Traffic types . . . . . . . . . . . . . . . . . . . . . . .18
       4.3.1  Bandwidth sharing. . . . . . . . . . . . . . . . . . . .18
       4.3.2  Bandwidth and QoS considerations . . . . . . . . . . . .18
       4.3.3  Point-to-point and point-to-multipoint traffic . . . . .19
   5   APS protocol. . . . . . . . . . . . . . . . . . . . . . . . . .19
     5.1.  Transmission and acceptance of APS requests . . . . . . . .21
     5.2.  APS PDU structure . . . . . . . . . . . . . . . . . . . . .21
     5.3.  Ring node APS states. . . . . . . . . . . . . . . . . . . .22
       5.3.1.  Idle state. . . . . . . . . . . . . . . . . . . . . . .22
       5.3.2.  Switching state . . . . . . . . . . . . . . . . . . . .22
       5.3.3.  Pass-through state . . . . . . . . . . . . . . . . . . 23
       5.3.4.  APS state transitions. . . . . . . . . . . . . . . . . 23






Umansky, et al.        Expires September 29, 2010               [Page 2]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   6.  Protection switching triggers. . . . . . . . . . . . . . . . . 26
     6.1.  Manual control . . . . . . . . . . . . . . . . . . . . . . 26
       6.1.1.  Commands not signaled on the APS protocol. . . . . . . 26
       6.1.2.  Commands using the APS protocol. . . . . . . . . . . . 26
     6.2.  Automatically initiated commands. .. . . . . . . . . . . . 27
     6.3.  APS state machine . . . . . . . . . . . . . . . . . . . . .28
       6.3.1.  Initial states. . . . . . . . . . . . . . . . . . . . .28
       6.3.2.  Transitions when local request is applied . . . . . . .29
       6.3.3.  Transitions when remote request is applied. . . . . . .32
       6.3.4.  Transitions when request addresses to another node is
               received. . . . . . . . . . . . . . . . . . . . . . . .34
   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . .38
   8.  Security Considerations . . . . . . . . . . . . . . . . . . . .38
   9.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . .38
   10. References. . . . . . . . . . . . . . . . . . . . . . . . . . .38
   Authors' Addresses. . . . . . . . . . . . . . . . . . . . . . . . .39


1.  Introduction

   Ring topologies are well known in SDH and SONET networks and is
   proven to be very effective and simple in terms of protection
   switching. Similar to SDH networks, MPLS networks can be built over
   ring topologies. Such networks allow for a simple, fast recovery
   time, and efficient protection mechanisms similar to the protection
   mechanisms in SDH, as well as high bandwidth utilization achievable
   by using the packet switching statistical multiplexing.

   MPLS shared protection ring can be viewed as equivalent to SDH MS
   shared protection ring architecture [G.841]

   The protection ring consists of two counter-rotating rings,
   transmitting in opposite directions relative to each other. Both
   rings carry working and protection traffic.

   The bandwidth on each ring is divided so that a part of ring capacity
   is dedicated for the working traffic and another part is dedicated to
   the protection traffic. The protection bandwidth on one ring is used
   to transport the working traffic from the other ring in case of
   failure. Part of ring bandwidth can also be dedicated to carry
   unprotected non-preemptable traffic (NUT).

2.  Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC-2119.




Umansky, et al.        Expires September 29, 2010               [Page 3]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


2.1.  Abbreviations

    APS      Automatic Protection Switching

    CCW      Counterclockwise

    EXER     Exercise

    FS       Forced Switch

    LP       Lockout of Protection

    LW       Lockout of Working

    NMS      Network Management System

    MPLS     Multi-Protocol Label Switching

    MPLS-TP  MPLS Transport Profile

    MRPS     MPLS-TP Ring Protection Switching

    MS       Manual Switch

    NR       No request

    NUT      Non-preemptable Unprotected Traffic

    OAM      Operation, Administration and Maintenance

    PDU      Payload Data Unit

    PS       Protection Switching

    QoS      Quality of Service

    RR       Reverse Request

    SF       Signal Fail

    WTR      Wait to Restore










Umansky, et al.        Expires September 29, 2010               [Page 4]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.  Ring protection schemes

3.1.  Wrapping

   The Wrapping technique implies that the node detecting a failure
   sends out an APS request to the (opposite to the failure) node
   adjacent to the failure. The APS request is transmitted over the APS
   communication protocol, as defined in [OAM framework]. When a node
   detects a failure or receives an APS request through APS protocol
   addressed to this node, the traffic of all working LSPs/tunnels
   transmitted towards the failed span is switched to the protection
   LSPs/tunnels in the opposite direction (away from the failure). This
   traffic travels around the ring to the other node (adjacent to the
   failure) where it is switched back onto the working LSPs/tunnels. The
   nodes that performed the protection switching revert back to the
   normal traffic flow when the failure or APS request is cleared.

   For each normal or working MPLS-TP LSP/tunnel, the protection
   LSP/tunnel MUST be established in the opposite direction though all
   nodes in the ring. Labels assigned for the protection LSPs/tunnels
   MUST be associated with the labels assigned for working LSPs/tunnels
   to allow proper traffic switching between the working and protection
   LSPs/tunnels.

3.1.1  Wrapping protection scheme applicability

   Wrapping protection scheme provides for fast and simple recovery of 
   p-t-p and p-t-mp LSPs in case of single or multiple failures in the
   ring. The protection mechanism in terms of nodes behavior, data path,
   signaled APS protocol messages is the same in all cases. In some
   scenarios with large networks additional latency may be introduced
   during protection switching in the ring because protection traffic
   travels along the all the ring.


















Umansky, et al.        Expires September 29, 2010               [Page 5]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.1.2  P-t-p LSP example

                            +---+    [P1]     +---+
                            | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                 [W1]\[P6]
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                 [W2]/[P5]
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C |
                            +---+    [P4]     +---+

      Figure 1: Labels allocation example for p-t-p LSP protection with
                          wrapping protection switching

   Working labels:
   A[W1]->B[W2]->C[W3]->D

   Protection labels:
   A[P1]->F[P2]->E[P3]->D[P4]->C[P5]->B[P6]->A

   Working and protection labels association:
   [W1]<->[P6]
   [W2]<->[P5]
   [W3]<->[P4]




















Umansky, et al.        Expires September 29, 2010               [Page 6]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.1.2.1  Link failure example

                            +---+    [P1]     +---+
                            | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                 [W1]\[P6]
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                     X
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C |
                            +---+    [P4]     +---+

             Figure 2: Wrapping protection switching operation
                     for p-t-p LSP in case of link failure

   When the failure occurs between the nodes B and C, these nodes
   send APS request to each other around the ring. Node B switches the
   traffic of LSP 1 from working label [W1] to the protection label [P6]
   in the opposite direction (CCW). This traffic travels around the ring
   to the node C where it is switched from protection label [P4] to the
   working label [W3] and sent to the node D where it is dropped from
   the ring.

   Traffic flow and labels use when the link failure occurs:
   A[W1]->B[P6]->A[P1]->F[P2]->E[P3]->D[P4]->C[W3]->D




















Umansky, et al.        Expires September 29, 2010               [Page 7]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.1.2.2.  Node failure example

                            +---+    [P1]     +---+
                            | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                     X
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                     X
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C |
                            +---+    [P4]     +---+

             Figure 3: Wrapping protection switching operation
                     for p-t-p LSP in case of node failure

   When node B fails or becomes isolated because of two failed links,
   nodes A and C send APS request to each other around the ring. Node A
   switches the traffic of LSP 1 to the protection label [P1] in the
   direction opposite to normal flow. This traffic travels around the
   ring to the node C where it is switched from the protection label
   [P4] to the working label [W3] and sent to the node D where it is
   dropped from the ring.

   Traffic flow and labels use when the node B failure occurs:
   A[P1]->F[P2]->E[P3]->D[P4]->C[W3]->D




















Umansky, et al.        Expires September 29, 2010               [Page 8]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.1.3.  P-t-mp LSP example

                            +---+    [P1]     +---+
                  LSP 1 <-- | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \ 
                        [P2]/[W5]             [W1]\[P6]
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\[W4]             [W2]/[P5]
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C | --> LSP1
                            +---+    [P4]     +---+

      Figure 4: Labels allocation example for p-t-mp LSP protection with
                          wrapping protection switching

   Working labels:
   A[W1]->B[W2]->C[W3]->D[W4]->E[W5]->F
                 |      |             |
                 v      v             v
               LSP 1  LSP 1         LSP 1

   Protection labels:
   A[P1]->F[P2]->E[P3]->D[P4]->C[P5]->B[P6]->A

   Working and protection labels association:
   [W1]<->[P6]
   [W2]<->[P5]
   [W3]<->[P4]
   [W4]<->[P3]
   [W5]<->[P2]















Umansky, et al.        Expires September 29, 2010               [Page 9]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.1.3.1  Link failure example

                            +---+    [P1]     +---+
                  LSP 1 <-- | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \ 
                        [P2]/[W5]             [W1]\[P6]
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\[W4]                 X
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C | --> LSP1
                            +---+    [P4]     +---+

             Figure 5: Wrapping protection switching operation
                     for p-t-mp LSP in case of link failure

   When the failure occurs between the nodes B and C, these nodes
   send APS request to each other around the ring. Node B switches the
   traffic of LSP 1 from working label [W1] to the protection label [P6]
   in the opposite direction (CCW). This traffic travels around the ring
   to the node C where it is switched from protection label [P4] to the
   working label [W3] and sent to the nodes D and F where it is dropped
   from the ring.

   Traffic flow and labels use when the link failure occurs:
   A[W1]->B[P6]->A[P1]->F[P2]->E[P3]->D[P4]->C[W3]->D[W4]->E[W5]->F
                                             |      |             |
                                             v      v             v
                                           LSP 1  LSP 1         LSP 1

















Umansky, et al.        Expires September 29, 2010              [Page 10]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.1.3.2.  Node failure example

                            +---+    [P1]     +---+
                  LSP 1 <-- | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                     X
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                     X
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C | --> LSP1
                            +---+    [P4]     +---+

             Figure 6: Wrapping protection switching operation
                     for p-t-p LSP in case of node failure

   When node B fails or becomes isolated because of two failed links,
   nodes A and C send APS request to each other around the ring. Node A
   switches the traffic of LSP 1 to the protection label [P1] in the
   direction opposite to normal flow. This traffic travels around the
   ring to the node C where it is switched from the protection label
   [P4] to the working label [W3] and sent to the nodes D and F where
   it is dropped from the ring.

   Traffic flow and labels use when the node B failure occurs:
   A[P1]->F[P2]->E[P3]->D[P4]->C[W3]->D[W4]->E[W5]->F
                               |      |             |
                               v      v             v
                              LSP 1  LSP 1         LSP 1

3.2.  Steering

   The Steering technique implies that the node detecting a failure
   sends an APS request to the node adjacent to the failure (away from
   the failure). The APS request is processed by all intermediate nodes
   in the ring. All nodes in the ring MUST analyze which LSPs are
   affected by the failure or APS request. This analysis is based on the
   ring node maps configured at each node in the ring and LSP maps
   provided at each source node (that adds traffic onto the ring) and
   sink node (that drops the traffic from the ring). For each affected
   LSP the source node and the sink node switches the traffic from
   working LSPs/tunnels to the protection LSPs/tunnels and restore
   normal traffic flow when the failure or APS request is cleared.



Umansky, et al.        Expires September 29, 2010              [Page 11]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.2.1  Steering protection scheme applicability

   Steering protection scheme provides for recovery of p-t-p and p-t-mp
   LSPs in case of single or multiple failures in the ring. The
   protection mechanism different for p-t-p and p-t-mp LSPs in terms of
   nodes behavior and data path. Signaled APS protocol messages are the
   same. Steering mechanism introduces less latency comparing to
   wrapping during protection switching in the ring but it requires more
   complex configuration. It also may affect the protection time because
   of more complex operation of switching nodes.

3.2.2  P-t-p LSP example

                            +---+    [P1]     +---+
                            | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                 [W1]\
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                 [W2]/
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C |
                            +---+             +---+

      Figure 7: Labels allocation example for p-t-p LSP protection with
                          steering protection switching

   Working labels:
   A[W1]->B[W2]->C[W3]->D

   Protection labels:
   A[P1]->F[P2]->E[P3]->D














Umansky, et al.        Expires September 29, 2010              [Page 12]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.2.2.1.  Link failure example

                            +---+    [P1]     +---+
                            | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                     \
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                     X
                             \                   /
                            +---+             +---+
                  LSP 1 <-- | D |-------------| C |
                            +---+             +---+

             Figure 8: Steering protection switching operation
                     for p-t-p LSP in case of link failure

   When the failure occurs between the nodes B and C, these nodes send
   APS request to each other around the ring. Nodes A and D analyze
   these requests and determine that LSP 1 is affected by the failure.
   Node A switches the traffic of LPS 1 to the protection label [P1] in
   the direction opposite to normal flow. This traffic travels around
   the ring to the node D where it is dropped from the ring.

   Traffic flow and labels use when the link failure occurs:
   A[P1]->F[P2]->E[P3]->D





















Umansky, et al.        Expires September 29, 2010              [Page 13]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010

3.2.2.2.  Node failure example

                            +---+    [P1]     +---+
                            | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                     X
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                     X
                             \                   /
                            +---+             +---+
                  LSP 1 <-- | D |-------------| C |
                            +---+             +---+

             Figure 9: Steering protection switching operation
                     for p-t-p LSP in case of link failure

   When node B fails or becomes isolated because of two failed links,
   nodes A and C send APS request to each other around the ring. Nodes A
   and D analyze these requests and determine that LSP 1 is affected by
   the failure. Node A switches the traffic of LSP 1 to the protection
   label [P1] in the direction opposite to normal flow. This traffic
   travels around the ring to the node D where it is dropped from the
   ring.

   Traffic flow in case of node B failure is presented below.
   A[P1]->F[P2]->E[P3]->D





















Umansky, et al.        Expires September 29, 2010              [Page 14]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.2.3  P-t-mp LSP example

                            +---+    [P1]     +---+
                  LSP 1 <-- | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/[W5]             [W1]\
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\[W4]             [W2]/
                             \                   /
                            +---+    [W3]     +---+
                  LSP 1 <-- | D |-------------| C | -> LSP 1
                            +---+    [P4]     +---+

     Figure 10: Labels allocation example for p-t-mp LSP protection with
                          steering protection switching

   Working labels:
   A[W1]->B[W2]->C[W3]->D[W4]->E[W5]->F
                 |      |             |
                 v      v             v
               LSP 1  LSP 1         LSP 1

   Protection labels:
   A[P1]->F[P2]->E[P3]->D[P4]->C
          |             |      |
          v             v      v
        LSP 1         LSP 1  LSP 1



















Umansky, et al.        Expires September 29, 2010              [Page 15]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.2.3.1.  Link failure example

                            +---+    [P1]     +---+
                  LSP 1 <-- | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                 [W1]\
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                        [P3]\                 [W2]/
                             \                   /
                            +---+             +---+
                  LSP 1 <-- | D |------X------| C | -> LSP 1
                            +---+             +---+

             Figure 11: Steering protection switching operation
                     for p-t-mp LSP in case of link failure

   When the failure occurs between the nodes C and D, these nodes send
   APS request to each other around the ring. Nodes A, C, D and F
   analyze these requests and determine that LSP 1 is affected by the
   failure. Node A duplicates the traffic of LPS 1 to the working label
   [W1] and the protection label [P1]. Node C detects that normal flow
   of LSP 1 is not affected and continues receiving working label [W2]
   without performing protection switching. Nodes D and F detect that
   normal flow of LSP 1 is affected and switch to protection labels
   [P3] and [P1] respectively.

   Traffic flow and working labels use when the link failure occurs:
   A[W1]->B[W2]->C->X
                 |
                 v
               LSP 1

   Traffic flow and protection labels use when the link failure occurs:
   A[P1]->F[P2]->E[P3]->D->X
          |             |
          v             v
        LSP 1        LSP 1









Umansky, et al.        Expires September 29, 2010              [Page 16]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


3.2.3.2.  Node failure example

                            +---+    [P1]     +---+
                  LSP 1 <-- | F |-------------| A | <- LSP 1
                            +---+             +---+
                             /                   \
                        [P2]/                 [W1]\
                           /                       \
                        +---+                     +---+
                        | E |                     | B |
                        +---+                     +---+
                           \                       /
                            X                 [W2]/
                             \                   /
                            +---+             +---+
                            | D |------X------| C | -> LSP 1
                            +---+             +---+

             Figure 12: Steering protection switching operation
                     for p-t-mp LSP in case of node failure

   When node D fails or becomes isolated because of two failed links,
   nodes E and C send APS request to each other around the ring. Nodes
   A, C and F analyze these requests and determine that LSP 1 is
   affected by the failure. Node A duplicates the traffic of LPS 1 to
   the working label [W1] and the protection label [P1]. Node C detects
   that normal flow of LSP 1 is not affected and continues receiving
   working label [W2] without performing protection switching. Node F
   detects that normal flow of LSP 1 is affected and switch to
   protection label [P1].

   Traffic flow and working labels use when the link failure occurs:
   A[W1]->B[W2]->C->X
                 |
                 v
               LSP 1

   Traffic flow and protection labels use when the link failure occurs:
   A[P1]->F[P2]->E[P3]->X
          |
          v
        LSP 1









Umansky, et al.        Expires September 29, 2010              [Page 17]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


4.  MRPS characteristics

4.1.  Switching types

   MRPS mechanism MUST support bi-directional protection switching type.
   In bi-directional switching, the traffic passing in both directions
   the monitored MPLS-TP section layer, including the affected direction
   and the unaffected direction, is switched to protection LSPs/tunnels.

4.2.  Operation types

   MRPS mechanism MUST support revertive protection operation type,
   which implies that the traffic will returns to (or remains on) the
   working LSPs/tunnels after the failure or APS request is cleared.

   MRPS mechanism MAY support non-revertive protection operation type,
   which implies that the traffic will remain on the protection
   LSPs/tunnels after the failure or APS request is cleared.

4.3.  Traffic types

4.3.1  Bandwidth sharing

   The bandwidth on each ring MUST be shared so that part of ring
   bandwidth capacity is guaranteed for the normal traffic and part is
   used for the protection traffic in case of failure on the ring. The
   protection part of the ring bandwidth rotating in one direction is
   used to carry the normal traffic from the ring rotating in other
   direction in case of failure.

   Part of ring bandwidth MAY also be dedicated to carry Non-preemptable
   Unprotected Traffic (NUT).

4.3.2  Bandwidth and QoS considerations

   The MRPS mechanism provides for the connectivity restoration of the
   normal traffic affected by a ring failure. The protection mechanism
   itself does not distinguish between different types of QoS associated
   with the given LSPs. It is also not aware of the bandwidth
   allocated or guaranteed for the protected or unprotected LSPs.

   In the MPLS-TP ring, in order to guarantee the bandwidth and QoS of
   the LSPs, normal or unprotected, traffic management and
   engineering measures SHOULD be taken. For example, the bandwidth and
   QoS parameters allocated for each protection LSP/tunnel can be equal
   to the bandwidth and QoS parameters of the associated working
   LSP/tunnel.

   Bandwidth and QoS parameters calculation and allocation for the
   normal and protection LSPs/tunnels are out of scope of this document.

Umansky, et al.        Expires September 29, 2010              [Page 18]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


4.3.3  Point-to-point and point-to-multipoint traffic

   Both point-to-point and drop-and-continue point-to-multipoint
   MPLS-TP LSPs/tunnels MUST be protected by MRPS. The APS protocol
   functionality as well as the node's reaction on different APS
   requests in case of ring failure SHOULD be identical for p-t-p
   and p-t-mp traffic.


5.  APS protocol

   The MRPS protection operation MUST be controlled with the help of
   the APS protocol. The APS processes in the each of the individual
   nodes that form the ring SHOULD communicate using MPLS-TP Section OAM
   APS PDUs.

   The APS protocol MUST carry the ring status information and APS
   requests, both automatic and externally initiated commands, between
   the ring nodes.

   Each node on the ring MUST be uniquely identified by assigning it a
   node ID. The maximum number of nodes on the ring supported by the APS
   protocol is 127. The node ID SHOULD be independent of the order in
   which the nodes appear on the ring. The node ID is used to
   identity the source and destination nodes of each APS request.

   Each node SHOULD have a ring map containing information about the
   sequence of the nodes around the ring. The method of configuring the
   nodes with the ring maps is TBD.

   When no protection switches are active on the ring, each node MUST
   dispatch periodically APS requests to the two adjacent nodes,
   indicating No Request (NR). When a node determines that a protection
   switching is required, it MUST send the appropriate APS request in
   both directions.
               
               +---+ A->B(NR)    +---+ B->C(NR)    +---+ C->D(NR)
        -------| A |-------------| B |-------------| C |-------
      (NR)F<-A +---+    (NR)A<-B +---+    (NR)B<-C +---+

            Figure 13: APS communication between the ring nodes
                      in case of no failures in the ring

   A destination node is a node that is adjacent to a node that
   identified a failed span. When a node that is not the destination
   node receives an APS request and it has no higher priority local
   request, it MUST transfer the APS request as received. In this way,
   the switching nodes can maintain direct APS protocol communication
   in the ring.


Umansky, et al.        Expires September 29, 2010              [Page 19]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


               +---+ C->B(SF)    +---+ B->C(SF)    +---+ C->B(SF)
        -------| A |-------------| B |----- X -----| C |-------
      (SF)C<-B +---+    (SF)C<-B +---+    (SF)B<-C +---+

           Figure 14: APS communication between the ring nodes
                 in case of failure between nodes B and C

   Note that in the case of a bidirectional failure such as a cable cut,
   two nodes detect the failure and send each other an APS request in
   opposite directions.

   - In rings utilizing the wrapping protection, when the destination
     node receives the APS request it MUST perform the switch from/to
     the working LSPs/tunnels to/from the protection LSPs/tunnels if it
     has no higher priority active APS request.

   - In rings utilizing the steering protection, when a ring switch is
     required, any node MUST perform the switches if its added/dropped
     traffic is affected by the failure. Determination of the affected
     traffic SHOULD be performed by examining the APS requests
     (indicating the nodes adjacent to the failure or failures)
     and the stored ring maps (indicating the relative position of the
     failure and the added traffic destined towards that failure).

   When the failure has cleared and the Wait-to-Restore (WTR) timer has
   expired, the nodes sourcing APS requests MUST drop their respective
   switches (tail end) and MUST source an APS request carrying NR code.
   The node receiving from both directions such APS request (head end)
   MUST drop its protection switches.

   A protection switch MUST be initiated by one of the criteria
   specified in clause 6. A failure of the APS protocol or controller
   MUST NOT trigger a protection switch.

   Ring switches MUST be preempted by higher priority APS requests. For
   example, consider a protection switch that is active due to a manual
   switch request on the given span, and another protection switch is
   required due to a failure on another span. Then a APS request MUST be
   generated, the former protection switch MUST be dropped, and the
   latter protection switch established.

   MRPS mechanism SHOULD support multiple protection switches in the
   ring, resulting the ring being segmented into two or more separate
   segments. This may happen when several APS requests of the same
   priority exist in the ring due to multiple failures or external
   switch commands.





Umansky, et al.        Expires September 29, 2010              [Page 20]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   Proper operation of the MRPS mechanism relies on all nodes having
   knowledge of the state of the ring (nodes and spans) so that nodes do
   not preempt existing APS request unless they have a higher-priority
   APS request. In order to accommodate ring state knowledge, during
   protection switch the APS requests MUST be sent in both directions.


5.1.  Transmission and acceptance of APS requests

   A new APS request MUST be transmitted immediately when a change in
   the transmitted status occurs.

   The first three APS protocol messages carrying new APS request
   SHOULD be transmitted as fast as possible. For fast protection
   switching within 50 ms, the interval of the first three APS
   protocol messages SHOULD be 3.3 ms. Then APS requests SHOULD be
   transmitted with the interval of 5 seconds.

5.2.  APS PDU structure

   Figure 5 depicts the format of an APS packet that is sent on the
   G-ACh. The Channel Type field is set to indicate that the message is
   an APS message. The ACH MUST NOT include the ACH TLV Header
   [RFC 5586] meaning that no ACH TLVs can be included in the message.
 
    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 1|0 0 0 0|0 0 0 0 0 0 0 0|    APS Channel Type (0xXX)    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     APS message (TBD)                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                    Figure 5: G-ACh APS Packet

APS message structure is TBD.

   The following fields MUST be provided:

   Destination Node ID: The destination node ID MUST always be set to
   value of a node ID of the adjacent node. Valid destination node ID
   values are 1-127.

   Source node ID: The source node ID MUST always be set to the value
   of the node ID generating the APS request. Valid source node ID
   values are 1-127.





Umansky, et al.       Expires September 29, 2010               [Page 21]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   APS request code: A code consisting of four bits
   as specified below.

               Bits  4-1        Condition, State           Priority
              (MSB - LSB)     or external Request

                1 1 1 1       Lockout of Protection (LP)    highest
                1 1 0 1       Forced Switch (FS)
                1 0 1 1       Signal Fail (SF)
                0 1 1 0       Manual Switch (MS)
                0 1 0 1       Wait-To-Restore (WTR)
                0 0 1 1       Exerciser (EXER)
                0 0 0 1       Reverse Request (RR)
                0 0 0 0       No Request (NR)               lowest

5.3.  Ring node APS states

   Idle state: A node is in the idle state when it has no APS request
   and is sourcing and receiving NR code to/from both directions.

   Switching state: A node not in the idle or pass-through states is in
   the switching state.

   Pass-through state: A node is in the pass-through state when its
   highest priority APS request is a request not destined to or sourced
   by it. The pass-through is bidirectional.

5.3.1.  Idle state

   A node in the idle state MUST source the NR request in both
   directions.

   A node in the idle state MUST terminate APS requests flow in both
   directions.

   A node in the idle state MUST block the traffic flow on protection
   LSPs/tunnels in both directions.

5.3.2.  Switching state

   A node in the switching state MUST source APS request to adjacent
   node with its highest APS request code in both directions when it
   detects a failure or receives an external command.

   A node in the switching state MUST terminate APS requests flow in
   both directions.





Umansky, et al.       Expires September 29, 2010               [Page 22]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   As soon as it receives an APS request from the short path, the node
   to which it is addressed MUST acknowledge the APS request by
   replying with the RR code on the short path, and with the received
   APS request code on the long path.

   This rule refers to the unidirectional failure detection: the RR
   SHOULD be issued only when the node does not detect the failure
   condition (i.e., the node is a head end), that is, it is not
   applicable when a failure is detected bidirectionally, because, in
   this latter case, both nodes send an APS request for the failure on
   both paths (short and long).

   The following switches MUST be allowed to coexist:

    - LP with LP
    - FS with FS
    - SF with SF
    - FS with SF

   When multiple MS APS requests over different spans exist at the same
   time, no switch SHOULD be executed and existing switches MUST be
   dropped. The nodes MUST signal, anyway, the MS APS request code.

   Multiple EXER request MUST be allowed to coexist in the ring.

   A node in a ring switching state that receives the external command
   LW for the affected span MUST drop its switch and MUST signal NR
   for the locked span if there is no other APS request on another span.
   Node still SHOULD signal relevant APS request for another span.

5.3.3.  Pass-through state

   When a node is in a pass-through state, it MUST transmit on one side,
   the same APS request as it receives from the other side.

   When a node is in a pass-through state, it MUST allow the traffic
   flow on protection LSPs/tunnels in both directions.

5.3.4.  APS state transitions

   All state transitions are triggered by an incoming APS request
   change, a WTR expiration, an externally initiated command, or locally
   detected MPLS-TP section failure conditions.

   APS requests due to a locally detected failure, an externally
   initiated command, or received APS request shall pre-empt existing
   APS requests in the prioritized order given in Clause 5.2, unless the
   requests are allowed to coexist.



Umansky, et al.       Expires September 29, 2010               [Page 23]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


5.3.4.1.  Transitions between the idle and pass-through states

   The transition from the idle state to pass-through state MUST be
   triggered by a valid APS request change, in any direction, from the
   NR code to any other code, as long as the new request is not
   destined for the node itself. Both directions move then into a
   pass-through state, so that, traffic entering the node through
   the protection LSPs/tunnels are by-passed across the node.

   A node MUST revert from pass-through state to the idle state when it
   detects NR codes incoming from both directions. Both directions
   revert simultaneously from the pass-through state to the idle state.

5.3.4.2.  Transitions between the idle and switching states

   Transition of a node from the idle state to the switching state MUST
   be triggered by one of the following conditions:

    - a valid APS request change from the NR code to any code received
      on either the long or the short path and destined to this node
    - an externally initiated command for this node
    - the detection of an MPLS-TP section layer failure at this node.

   Actions taken at a node in idle state upon transition to switching
   state are:

    - for all protection switch requests, except EXER and LP, the node
      MUST execute the switch

    - for EXER, and LP, the node MUST signal appropriate request but not
      execute the switch.

   A node MUST revert from the switching state to the idle state when
   it detects NR codes received from both directions.

    - At the tail end: When a WTR time expires or an externally 
      initiated command is cleared at a node, the node MUST drop its
      switch, transit to Idle state and signal the NR code in both
      directions.

    - At the head end: Upon reception of the NR code, from both
      directions, the head-end node MUST drop its switch, transition
      to Idle state and signal the NR code in both directions.








Umansky, et al.       Expires September 29, 2010               [Page 24]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


5.3.4.3.  Transitions between switching states

   When a node that is currently executing any protection switch
   receives a higher priority APS request (due to a locally detected
   failure, an externally initiated command, or a ring protection switch
   request destined to it) for the same span, it MUST upgrade the
   priority of the switch it is executing to the priority of the
   received APS request.

   When a failure condition clears at a node, the node MUST enter
   WTR condition and remain in it for the appropriate time-out
   interval, unless:

    - a different APS request of higher priority than WTR is received
    - another failure is detected
    - an externally initiated command becomes active.

   The node MUST send out a WTR code on both the long and short paths.

   When a node that is executing a switch in response to incoming SF
   APS request (not due to a locally detected failure) receives a WTR
   code (unidirectional failure case), it MUST send out RR code on the
   short path and the WTR on the long path.

5.3.4.4  Transitions between switching and pass-through states

   When a node that is currently executing a switch receives an APS
   request for a non-adjacent span of higher priority than the switch it
   is executing, it MUST drop its switch immediately and enter the
   pass-through state.


   The transition of a node from pass-through to switching state MUST be
   triggered by:

    - an equal, higher priority, or allowed coexisting externally
      initiated command
    - the detection of an equal, higher priority, or allowed coexisting
      failure
    - the receipt of an equal, higher priority, or allowed coexisting
      APS request destined to this node.










Umansky, et al.       Expires September 29, 2010               [Page 25]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


6.  Protection switching triggers

   Protection switching action MUST be conducted when:

    - they are initiated by operator control (e.g., manual switch,
      forced switch, and lockout of protection) without a higher
      priority APS request being in effect on addressed span or entire
      ring

    - an MPLS-TP Section SF is declared on the associated span and
      without a higher priority APS request (e.g., lockout of
      protection, forced switch) being in effect on addressed span or
      entire ring and the hold-off timer has expired
    - the wait to restore timer expires.

6.1.  Manual control

   Externally initiated commands are entered by the operator through
   the Network Management System (NMS) or the Craft interface.

6.1.1.  Commands not signaled on the APS protocol

   The node MUST support the following commands that are not transferred
   by the APS protocol:

   - Clear: This command clears the externally initiated command and
     WTR timer at the node to which the command was addressed. The
     node-to-node signaling following removal of the externally
     initiated commands MUST be performed using the NR code.

   - Lockout of Working: This command prevents the normal traffic
     transported over the addressed span from being switched to the
     protection LSPs/tunnels by disabling the node's capability of
     requesting the protection switching for this span in case of
     failure. If any normal traffic is already switched on the
     protection LSPs/tunnels, the switch MUST be dropped. If no other
     APS requests are active on the ring, the NR code MUST be
     transmitted. This command has no impact on any other span. If the

     node receives the APS request from the adjacent node from any side
     it MUST perform the requested switch. If the node receives the
     request addressed to the other node it MUST go to the pass-through
     state.

6.1.2.  Commands using the APS protocol

   The node MUST support the following commands that are transferred by
   the APS protocol:



Umansky, et al.       Expires September 29, 2010               [Page 26]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


    - Lockout of Protection (LP): This command prevents any protection
      activity and prevents using protection switches anywhere in the
      ring. All existing switches in the ring MUST be dropped.

    - Forced Switch to protection (FS): This command performs the ring
      switch of normal traffic from the working LSPs/tunnels to the
      protection LSPs/tunnels for the span between the node at which the
      command is initiated and the adjacent node to which the command is
      directed. This switch MUST occur regardless of the state of the
      spans adjacent to this node unless it is satisfying a higher
      priority APS request.

    - Manual Switch to protection (MS): This command performs the ring
      switch of the normal traffic from the working LSPs/tunnels to the
      protection LSPs/tunnels for the span between the node at which the
      command is initiated and the adjacent node to which the command
      is directed. This occurs if the node is not satisfying an equal
      or higher priority APS request.

   The node MAY support the following commands that are transferred by
   the APS protocol:

    - Exercise - (EXER): This command exercises ring protection
      switching on the addressed span without completing the actual
      switch. When the command issued the RR responses are checked, but
      no normal traffic is affected.

6.2.  Automatically initiated commands

   Automatically initiated commands can be initiated based on MPLS-TP
   section layer and equipment performance criteria and received APS
   requests.

   The node MUST support the following APS requests that are initiated
   automatically:

    - Signal Fail (SF): This command is issued when the MPLS-TP section
      detects signal failure condition. When the tail-end detects the
      failure it MUST generate the APS request towards the head-end.

    - Wait-To-Restore (WTR): This command is issued when MPLS-TP section
      detects that the SF condition has cleared. It is used to maintain
      the state during the WTR period unless it is pre-empted by a
      higher priority APS request. The Wait to Restore time SHOULD be
      configured by the operator in 1 minute steps between 0 and 72
      hours. The default value SHOULD be 5 minutes.

    - Reverse Request (RR): This command MUST be transmitted to the
      tail-end node over the short path as an acknowledgment for
      receiving the APS request.

Umansky, et al.       Expires September 29, 2010               [Page 27]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


6.3  APS state machine

6.3.1  Initial states

            State                      Signaled APS

   A        Idle                       NR
            Working: no switch
            Protection: no switch

   B        Pass-trough                N/A
            Working: no switch
            Protection: pass through

   C        Switching - LP             LP
            Working: no switch
            Protection: no switch

   D        Idle - LW                  NR
            Working: no switch
            Protection: no switch

   E        Switching - FS             FS
            Working: switched
            Protection: switched

   F        Switching - SF             SF
            Working: switched
            Protection: switched

   G        Switching - MS             MS
            Working: switched
            Protection: switched

   H        Switching - WTR            WTR
            Working: switched
            Protection: switched

   I        Switching - EXER           EXER
            Working: no switch
            Protection: no switch










Umansky, et al.       Expires September 29, 2010               [Page 28]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


6.3.2 APS state transitions when local request is applied

   In the state description below 'O' means that new local request will
   be rejected because of exiting request.
   ---------------------------------------------------------------------
   Initial state        New request       New state
   A (Idle)             LP                C (Switching - LP)
                        LW                D (Idle - LW)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        Recover from SF   N/A
                        MS                G (Switching - MS)
                        Clear             N/A
                        WTR expires       N/A
                        EXER              I (Switching - EXER)
   ---------------------------------------------------------------------
   Initial state        New request       New state
   B (Pass-trough)      LP                C (Switching - LP)
                        LW                B (Pass-trough)
                        FS                O - if current state is due to
                                              LP sent by another node
                                          E (Switching - FS) - otherwise
                        SF                O - if current state is due to
                                              LP sent by another node
                                          F (Switching - SF) - otherwise
                        Recover from SF   N/A
                        MS                O - if current state is due to
                                              LP, SF or FS sent by
                                              another node
                                          G (Switching - MS) - otherwise
                        Clear             N/A
                        WTR expires       N/A
                        EXER              O
   ---------------------------------------------------------------------
   Initial state        New request       New state
   C (Switching - LP)   LP                N/A
                        LW                O
                        FS                O
                        SF                O
                        Recover from SF   N/A
                        MS                O
                        Clear             A (Idle) - if there is no
                                             failure in the ring
                                          F (Switching - SF) - if there
                                             is a failure at this node
                                          B (Pass-trough) - if there is
                                             a failure at another node
                        WTR expires       N/A
                        EXER              O


Umansky, et al.       Expires September 29, 2010               [Page 29]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   ---------------------------------------------------------------------
   Initial state        New request       New state
   D (Idle - LW)        LP                C (Switching - LP)
                        LW                N/A - if on the same span
                                          D (Idle - LW) - if on another
                                             span
                        FS                O - if on the same span
                                          E (Switching - FS) - if on
                                             another span
                        SF                O - if on the addressed span
                                          F (Switching - SF) - if on
                                             another span
                        Recover from SF   N/A
                        MS                O - if on the same span
                                          G (Switching - MS) - if on
                                             another span
                        Clear             A (Idle) - if there is no
                                             failure on addressed span
                                          F (Switching - SF) - if there
                                             is a failure on this span
                        WTR expires       N/A
                        EXER              O
   ---------------------------------------------------------------------
   Initial state        New request       New state
   E (Switching - FS)   LP                C (Switching - LP)
                        LW                O - if on another span
                                          D (Idle - LW) - if on the same
                                             span
                        FS                N/A - if on the same span
                                          E (Switching - FS) - if on
                                             another span
                        SF                O - if on the addressed span
                                          E (Switching - FS) - if on
                                             another span
                        Recover from SF   N/A
                        MS                O
                        Clear             A (Idle) - if there is no
                                             failure in the ring
                                          F (Switching - SF) - if there
                                             is a failure at this node
                                          B (Pass-trough) - if there is
                                             a failure at another node
                        WTR expires       N/A
                        EXER              O







Umansky, et al.       Expires September 29, 2010               [Page 30]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   ---------------------------------------------------------------------
   Initial state        New request       New state
   F (Switching - SF)   LP                C (Switching - LP)
                        LW                O - if on another span
                                          D (Idle - LW) - if on the same
                                             span
                        FS                E (Switching - FS)
                        SF                N/A - if on the same span
                                          F (Switching - SF) - if on
                                             another span
                        Recover from SF   H (Switching - WTR)
                        MS                O
                        Clear             N/A
                        WTR expires       N/A
                        EXER              O
   ---------------------------------------------------------------------
   Initial state        New request       New state
   G (Switching - MS)   LP                C (Switching - LP)
                        LW                O - if on another span
                                          D (Idle - LW) - if on the same
                                             span
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        Recover from SF   N/A
                        MS                N/A - if on the same span
                                          G (Switching - MS) - if on
                                             another span release the
                                             switches but signal MS
                        Clear             A
                        WTR expires       N/A
                        EXER              O
   ---------------------------------------------------------------------
   Initial state        New request       New state
   H (Switching - WTR)  LP                C (Switching - LP)
                        LW                D (Idle - W)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        Recover from SF   N/A
                        MS                G (Switching - MS)
                        Clear             A
                        WTR expires       A
                        EXER              O









Umansky, et al.       Expires September 29, 2010               [Page 31]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


---------------------------------------------------------------------
   Initial state        New request       New state
   I (Switching - EXER) LP                C (Switching - LP)
                        LW                D (idle - W)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        Recover from SF   N/A
                        MS                G (Switching - MS)
                        Clear             A
                        WTR expires       N/A
                        EXER              N/A - if on the same span
                                          I (Switching - EXER)

6.3.3 Transitions when remote request is applied

   The priority of remote request does not depend on the side from which
   the request is received.
   ---------------------------------------------------------------------
   Initial state        New request       New state
   A (Idle)             LP                C (Switching - LP)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        MS                G (Switching - MS)
                        WTR               N/A
                        EXER              I (Switching - EXER)
                        RR                N/A
                        NR                A (Idle)
   ---------------------------------------------------------------------
   Initial state        New request       New state
   B (Pass-trough)      LP                C (Switching - LP)
                        FS                N/A - cannot happen when there
                                               is LP request in the ring
                                          E (Switching - FS) - otherwise
                        SF                N/A - cannot happen when there
                                               is LP request in the ring
                                          F (Switching - SF) - otherwise
                        MS                N/A - cannot happen when there
                                                is LP, FS or SF request
                                                in the ring
                                          G (Switching - MS) - otherwise
                        WTR               N/A - cannot happen when there
                                                is LP, FS, SF or MS
                                                request in the ring
                        EXER              N/A - cannot happen when there
                                                is LP, FS, SF, MS or WTR
                                                request in the ring
                                          I (Switching - EXER) -
                                                otherwise
                        RR                N/A
                        NR                A (Idle) - if received from
                                                both sides
Umansky, et al.       Expires September 29, 2010               [Page 32]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   ---------------------------------------------------------------------
   Initial state        New request       New state
   C (Switching - LP)   LP                C (Switching - LP)
                        FS                N/A - cannot happen when there
                                               is LP request in the ring
                        SF                N/A - cannot happen when there
                                               is LP request in the ring
                        MS                N/A - cannot happen when there
                                               is LP request in the ring
                        WTR               N/A
                        EXER              N/A - cannot happen when there
                                               is LP request in the ring
                        RR                C (Switching - LP)
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   D (Idle - LW)        LP                C (Switching - LP)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        MS                G (Switching - MS)
                        WTR               N/A
                        EXER              I (Switching - EXER)
                        RR                N/A
                        NR                D (Idle - LW)
   ---------------------------------------------------------------------
   Initial state        New request       New state
   E (Switching - FS)   LP                C (Switching - LP)
                        FS                E (Switching - FS)
                        SF                E (Switching - FS)
                        MS                N/A - cannot happen when there
                                               is FS request in the ring
                        WTR               N/A
                        EXER              N/A - cannot happen when there
                                               is FS request in the ring
                        RR                E (Switching - FS)
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   F (Switching - SF)   LP                C (Switching - LP)
                        FS                F (Switching - SF)
                        SF                F (Switching - SF)
                        MS                N/A - cannot happen when there
                                               is SF request in the ring
                        WTR               N/A
                        EXER              N/A - cannot happen when there
                                               is SF request in the ring
                        RR                F (Switching - SF)
                        NR                N/A
   ---------------------------------------------------------------------


Umansky, et al.       Expires September 29, 2010               [Page 33]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


Initial state        New request       New state
   G (Switching - MS)   LP                C (Switching - LP)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        MS                G (Switching - MS) - release
                                             the switches but signal MS
                        WTR               N/A
                        EXER              N/A - cannot happen when there
                                               is MS request in the ring
                        RR                G (Switching - MS)
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   H (Switching - WTR)  LP                C (Switching - LP)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        MS                G (Switching - MS)
                        WTR               H (Switching - WTR)
                        EXER              N/A - cannot happen when there
                                              is WTR request in the ring
                        RR                H (Switching - WTR)
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   I (Switching - EXER) LP                C (Switching - LP)
                        FS                E (Switching - FS)
                        SF                F (Switching - SF)
                        MS                G (Switching - MS)
                        WTR               N/A
                        EXER              I (Switching - EXER)
                        RR                I (Switching - EXER)
                        NR                N/A

6.3.4.  Transitions when request addresses to another node is received

   The priority of remote request does not depend on the side from which
   the request is received.

   ---------------------------------------------------------------------
   Initial state        New request       New state
   A (Idle)             LP                B (Pass-trough)
                        FS                B (Pass-trough)
                        SF                B (Pass-trough)
                        MS                B (Pass-trough)
                        WTR               B (Pass-trough)
                        EXER              B (Pass-trough)
                        RR                N/A
                        NR                N/A



Umansky, et al.       Expires September 29, 2010               [Page 34]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   ---------------------------------------------------------------------
   Initial state        New request       New state
   B (Pass-trough)      LP                B (Pass-trough)
                        FS                N/A - cannot happen when there
                                               is LP request in the ring
                                          B (Pass-trough) - otherwise
                        SF                N/A - cannot happen when there
                                               is LP request in the ring
                                          B (Pass-trough) - otherwise
                        MS                N/A - cannot happen when there
                                                is LP, FS or SF request
                                                in the ring
                                          B (Pass-trough) - otherwise
                        WTR               N/A - cannot happen when there
                                                is LP, FS, SF or MS
                                                request in the ring
                                          B (Pass-trough) - otherwise
                        EXER              N/A - cannot happen when there
                                                is LP, FS, SF, MS or WTR
                                                request in the ring
                                          B (Pass-trough) - otherwise
                        RR                N/A
                        NR                B (Pass-trough)
   ---------------------------------------------------------------------
   Initial state        New request       New state
   C (Switching - LP)   LP                C (Switching - LP)
                        FS                N/A - cannot happen when there
                                               is LP request in the ring
                        SF                N/A - cannot happen when there
                                               is LP request in the ring
                        MS                N/A - cannot happen when there
                                               is LP request in the ring
                        WTR               N/A - cannot happen when there
                                               is LP in the ring
                        EXER              N/A - cannot happen when there
                                               is LP request in the ring
                        RR                N/A
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   D (Idle - LW)        LP                B (Pass-trough)
                        FS                B (Pass-trough)
                        SF                B (Pass-trough)
                        MS                B (Pass-trough)
                        WTR               B (Pass-trough)
                        EXER              B (Pass-trough)
                        RR                N/A
                        NR                N/A



Umansky, et al.       Expires September 29, 2010               [Page 35]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010

   ---------------------------------------------------------------------
   Initial state        New request       New state
   E (Switching - FS)   LP                B (Pass-trough)
                        FS                E (Switching - FS)
                        SF                E (Switching - FS)
                        MS                N/A - cannot happen when there
                                               is FS request in the ring
                        WTR               N/A - cannot happen when there
                                               is FS request in the ring
                        EXER              N/A - cannot happen when there
                                               is FS request in the ring
                        RR                N/A
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   F (Switching - SF)   LP                B (Pass-trough)
                        FS                F (Switching - SF)
                        SF                F (Switching - SF)
                        MS                N/A - cannot happen when there
                                               is SF request in the ring
                        WTR               N/A - cannot happen when there
                                               is SF request in the ring
                        EXER              N/A - cannot happen when there
                                               is SF request in the ring
                        RR                N/A
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   G (Switching - MS)   LP                B (Pass-trough)
                        FS                B (Pass-trough)
                        SF                B (Pass-trough)
                        MS                G (Switching - MS) - release
                                             the switches but signal MS
                        WTR               N/A - cannot happen when there
                                               is MS request in the ring
                        EXER              N/A - cannot happen when there
                                               is MS request in the ring
                        RR                N/A
                        NR                N/A
   ---------------------------------------------------------------------
   Initial state        New request       New state
   H (Switching - WTR)  LP                B (Pass-trough)
                        FS                B (Pass-trough)
                        SF                B (Pass-trough)
                        MS                B (Pass-trough)
                        WTR               N/A
                        EXER              N/A - cannot happen when there
                                              is WTR request in the ring
                        RR                N/A
                        NR                N/A


Umansky, et al.       Expires September 29, 2010               [Page 36]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   ---------------------------------------------------------------------
   Initial state        New request       New state
   I (Switching - EXER) LP                B (Pass-trough)
                        FS                B (Pass-trough)
                        SF                B (Pass-trough)
                        MS                B (Pass-trough)
                        WTR               N/A
                        EXER              I (Switching - EXER)
                        RR                N/A
                        NR                N/A









































Umansky, et al.       Expires September 29, 2010               [Page 37]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


7.  IANA Considerations

   Channel Types for the Generic Associated Channel are allocated from
   the IANA PW Associated Channel Type registry defined in [RFC 4446]
   and updated by [RFC 5586].

   IANA is requested to allocate two further Channel Types as follows:

    - 0xXX Automatic Protection Switching (APS)

   Note to RFC Editor: this section may be removed on publication as an
   RFC.

8.  Security Considerations

   This document does not by itself raise any particular security
   considerations.


9.  Acknowledgements


10.  References

8.1.  Normative References

   [RFC 2119]
              Bradner, S., Editor, "Key words for use in RFCs to
              Indicate Requirement Levels", BCP 14, RFC2119, April 1997.

8.2.  Informative References

   [MPLS-TP Reqs]
              Niven-Jenkins, B., Brungard, D., Betts, M., Sprecher, N.,
              and S. Ueno, "Requirements for the Trasport Profile of
              MPLS", ID draft-ietf-mpls-tp-requirements-09, June 2009.

   [G.841]
              ITU-T Recommendation G.841 (1998), Types and
              characteristics of SDH network protection architectures.

   [MPLS-TP OAM]
              Busi,I., Niven-Jenkins, B., "MPLS-TP OAM Framework and
              Overview", draft-ietf-mpls-tp-oam-framework-01 (work in
              progress), July 2009.
              
   [RFC 5586]
              M. Bocci, M. Vigoureux, S. Bryant," MPLS Generic
              Associated Channel", RFC 5586, June 2009.


Umansky, et al.       Expires September 29, 2010               [Page 38]

Internet-Draft      MPLS-TP Ring Protection Switching         March 2010


   [RFC 4446]
              L. Martini, IANA Allocations for Pseudowire Edge to Edge
              Emulation (PWE3), RFC 4446, April 2006.



Authors' Addresses

   Igor Umansky
   Alcatel-Lucent
   Email: igor.umansky@alcatel-lucent.com


   Italo Busi
   Alcatel-Lucent
   Email: italo.busi@alcatel-lucent.com


   Huub van Helvoort
   Huawei Technologies Co., Ltd.
   Email: hhelvoort@huawei.com


   Haiyan Zhang
   Huawei Technologies Co., Ltd.
   Email: zhanghaiyan@huawei.com


   Han Li
   China Mobile Communications Corporation
   Email: lihan@chinamobile.com


   Ruiquan Jing
   China Telecom
   Email: jingrq@ctbri.com.cn















Umansky, et al.       Expires September 29, 2010               [Page 39]
